{
    "category_asin": 23581299011,
    "category_name": "Home Security Solar Chargers",
    "product_list": [
        {
            "category_asin": 23581299011,
            "category_name": "Home Security Solar Chargers",
            "product_asin": "B099HXDWZS",
            "title": "Blink Outdoor (3rd Gen) + Solar Panel Charging Mount – wireless, HD smart security camera, solar-powered, motion detection – Add-on camera (Sync Module required)",
            "review_num": 4,
            "rating": 3.9,
            "description": [
                "Blink Outdoor is a wire-free smart security camera with HD day and infrared night vision, two-way audio, and motion detection that lets you see, hear, and speak to visitors from the Blink Home Monitor app.",
                "Blink Solar Panel Mount uses power from the sun to continuously power Blink Outdoor providing non-stop peace of mind.",
                "Choose to save and share clips in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with a Sync Module 2 and USB drive (each sold separately).",
                "Flexible placement — pivot the solar panel when attached or detach and move up to two feet away from your camera.",
                "Get motion detection alerts on your phone with the option to customize motion zones in the Blink Home Monitor app so you’re only alerted when you need to be.",
                "Set up yourself in minutes — connect Outdoor to wifi and follow in-app instructions. Place mount in direct sunlight with the included kit or with no-drill installation (required hooks and Sync Module 2 sold separately).",
                "Works with Alexa – use your voice to monitor your home through supported Alexa-enabled devices.",
                "Includes one Blink Outdoor camera, one Solar Panel Mount, one mounting kit, one housing cover, one mount, and one right angle adapter. Sync Module 2 sold separately."
            ],
            "model": "Add-on Camera",
            "price": 99.99,
            "status": "In Stock",
            "last_month_sold": 500,
            "created_date": "2024-09-01T00:51:38.180095"
        },
        {
            "category_asin": 23581299011,
            "category_name": "Home Security Solar Chargers",
            "product_asin": "B09GZPNV8P",
            "title": "Blink Outdoor (3rd Gen) + Solar Panel Charging Mount - wireless, HD smart security camera, solar-powered, motion detection – 1 camera system",
            "review_num": 4,
            "rating": 3.9,
            "description": [
                "Blink Outdoor is a wire-free smart security camera with HD day and infrared night vision, two-way audio, and motion detection that lets you see, hear, and speak to visitors from the Blink Home Monitor app.",
                "Blink Solar Panel Mount uses power from the sun to continuously charge Blink Outdoor providing non-stop peace of mind.",
                "Choose to save and share clips in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with a Sync Module 2 and USB drive (sold separately).",
                "Flexible placement — pivot the solar panel when attached or detach and move up to two feet away from your camera.",
                "Get motion detection alerts on your phone with the option to customize motion zones in the Blink Home Monitor app so you’re only alerted when you need to be.",
                "Set up yourself in minutes — connect Outdoor to wifi and follow in-app instructions. Place mount in direct sunlight with the included kit or with no-drill installation (required hooks sold separately).",
                "Works with Alexa — use your voice to monitor your home through supported Alexa-enabled devices.",
                "Includes one Blink Outdoor camera, one Sync Module 2, one Solar Panel Mount, one mounting kit, one housing cover, one mount, one power cable, one power adapter, and one right angle adapter."
            ],
            "model": "1 Camera System",
            "price": null,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-01T00:51:52.165313"
        },
        {
            "category_asin": 23581299011,
            "category_name": "Home Security Solar Chargers",
            "product_asin": "B09KKFPGRQ",
            "title": "Blink Outdoor (3rd Gen) + Solar Panel Charging Mount – wireless, HD smart security camera, solar-powered, motion detection – 3 camera system",
            "review_num": 4,
            "rating": 3.9,
            "description": [
                "Blink Outdoor works with the Solar Panel Charging Mount to provide a wire-free smart security camera with HD day and infrared night vision, two-way audio, and motion detection that never runs out of power with a sustainable charge from the sun.",
                "Choose to save and share clips in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with a Sync Module 2 and USB drive (sold separately).",
                "Flexible placement — pivot the solar panel when attached or detach and move up to two feet away from your camera.",
                "Set up yourself in minutes — connect Outdoor to wifi and follow in-app instructions. Place mount in direct sunlight with the included kit or with no-drill installation (required hooks sold separately).",
                "See, hear, and speak to visitors with live view in real time and two-way audio features on your Blink app.",
                "Get motion detection alerts on your phone with the option to customize motion zones in the Blink Home Monitor app so you’re only alerted when you need to be.",
                "Works with Alexa — use your voice to monitor your home through supported Alexa-enabled devices.",
                "This bundle contains three new Blink Solar Cameras, one Sync Module 2, and three mounting kits."
            ],
            "model": "3 Camera System",
            "price": null,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-01T00:52:05.760066"
        },
        {
            "category_asin": 23581299011,
            "category_name": "Home Security Solar Chargers",
            "product_asin": "B09BK7CY13",
            "title": "Blink Solar Panel 13 Foot Extension Cable — Black",
            "review_num": 172,
            "rating": 4.3,
            "description": [
                "Use to detach and mount your solar panel up to 15 feet from your Blink Outdoor camera and Blink Solar Panel Mount.",
                "Compatible with Blink Solar Panel Mount only.",
                "One (1) 2 foot extension cable is included with initial purchase of each Blink Solar Panel Mount."
            ],
            "model": null,
            "price": 12.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-01T00:52:18.814987"
        }
    ],
    "product_count": 0,
    "sub_category_count": 0
}