{
    "url": "https://www.amazon.com/gp/new-releases/appliances/ref=zg_bsnr_nav_appliances_0",
    "category_asin": -1,
    "category_name": "Appliances",
    "product_list": [
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D93V1F1C",
            "title": "HealSmart Ice Maker for Countertop, 9 Ice Cubes Ready in 6 Mins, 26lbs Ice/24Hrs, with Self-Cleaning Feature, Ice Spoon and Basket, for Home, Kitchen, Camping, Party, Black",
            "review_num": 32,
            "rating": 4.4,
            "description": [
                "Compact and Portable:The lightweight and portable design of the mini–ice maker makes it easy to store or carry, just 8.8(W)*11.6(D)*11.4(H) inches and weighs less than 14lbs, more light than other brand, widely used in home, kitchen, office, bar etc.",
                "Quickly Ice Making: Just pour water into the ice maker, run it for 6-8 mins, then you can enjoy 9 ice cubes. It even can produce up to 26 pounds of ice per day, will be a perfect substitute for the old one in your home.",
                "Self-cleaning function: With self-cleaning function, just press on/off button for 5s to start self-cleaning mode, which allows you not to worry how and take time to clean it. Add a little lemon or soda to help better cleaning.",
                "Quiet Operation: Operates at a low 35 decibel level, so you can have a quiet environment. This ensures that you are not disturbed by noise.",
                "Easy to use: Just fill the ice maker with water (less than 1.2L), press the ON button. With infrared sensor, when the ice basket is full (over 1.3lbs), or the water is insufficient, the indicator light will turn on, it will stop the ice making."
            ],
            "model": "Black",
            "price": 54.99,
            "status": "Temporarily out of stock.",
            "last_month_sold": 3000,
            "created_date": "2024-09-04T14:50:52.382431"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D226TYH6",
            "title": "Ice Maker Countertop, Portable Ice Machine 9 Cubes in 6 Mins, 26 lbs in 24 Hrs,Two Sizes of Bullet Ice Self-Cleaning with Ice Scoop, Bag, and Basket, for Kitchen, Party, RV, Bar-Black",
            "review_num": 72,
            "rating": 4.5,
            "description": [
                "Six Mins Ice Magic: Ready to cool your drinks in no time with this countertop ice maker. Get nine ice cubes in just six minutes and up to 26 pounds in 24 hours. Enjoy ice on demand at home, no need to go out for a refill",
                "Store Ice in Fridge: If the ice cubes in the basket aren't used for a while, they'll melt. To store them for later use,please use the provided ice bags and scoop to transfer the ice cubes to the refrigerator",
                "Compact Size & Easy Carry: Say goodbye to bulky appliances! Our countertop ice maker's sleek, small design fits perfectly in any space. With a sturdy handle, carrying it from place to place is a breeze. It is fits into kitchens, camping, bars and RVs",
                "Easy Use & Whisper-Quiet: Our ice makers are a breeze to operate with their simple control panel and user-friendly interface! Experience Ice Making with Whisper-Quiet Operation, lower than 35 dB, just like a working fridge",
                "Quick & Painless Self-Cleaning: Simply press the ON/OFF button for five seconds to enjoy a sparkling clean ice machine. Spend less time and have more fun making ice",
                "Two Size of Ice Cube: You can make two sizes of bullet ice cubes, catering to all your cooling needs with perfect versatility. Small ice cubes quickly chill sodas and iced coffee. Large ice cubes are perfect for keeping beverages"
            ],
            "model": "8.7\"D x 11.6\"W x 11.4\"H",
            "price": 99.99,
            "status": "In Stock",
            "last_month_sold": 1000,
            "created_date": "2024-09-04T14:51:23.008904"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D4DYQQXH",
            "title": "COSTWAY Mini Portable Washing Machine, 5.5 lbs Washing Capacity, Compact Laundry Washer with Durable Design, Single Tub, Rotary Controller, Small Washer Machine for Home Apartment Dorms and RV, Grey",
            "review_num": 22,
            "rating": 4.1,
            "description": [
                "[Compact & Portable Washing Machine] Whether you are dealing with limited room in your home, apartment, dorms or looking to save space in your RV, this washer provides a practical laundry solution. Product Size: 14” x 13.5” x 20”(L x W x H).",
                "[All-in-one Tub with Spin Basket] This single tub machine with spin basket seamlessly transitions between washing and spinning functions. With 5.5 lbs washing capacity, the laundry washer is easy to tackle multiple loads at once.",
                "[Simple Operation] The 10 minutes wash timer and 5 minutes spin timer settings allow for easy operation. Select your settings with a simple turn of the rotary controller, facilitating an easier laundry experience.",
                "[User-friendly Design] Equipped with an easy drainage system, the laundry washer allows you to dispose of water quickly. Moreover, the drain hose and inlet hose kit offer more flexibility with installation while the see-through lid is easy to monitor the water condition.",
                "[Powerful Motor] The powerful motor boasts outstanding washing performance to help you get the cleaning job done. Meanwhile, this portable washing machine minimizes water and energy consumption."
            ],
            "model": null,
            "price": null,
            "status": "Currently unavailable.",
            "last_month_sold": null,
            "created_date": "2024-09-04T14:54:06.183539"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D4YLWQMM",
            "title": "Ice Makers Countertop with Reservation, 28LBs/24H, 9 Ice Cubes Ready in 6 Mins, Self-Cleaning Ice Maker Machine with Basket and Scoop for Home, Kitchen, Camping, RV, Stainless Steel",
            "review_num": 34,
            "rating": 4.5,
            "description": [
                "Fast Ice Making with High-quality Compressors: Our countertop ice maker is equipped with a high-quality compressor, which means faster ice making speed and less noise. It can make 9 pcs of ice in 6 minutes and 28LB of ice a day. Removable ice basket can holds 60-80 ice cubes. The noise does not exceed 43 decibels",
                "Ice Maker with Reservation Function: This ice maker features a convenient scheduling function that allows you to set the ice-making time in advance. Simply program the ice maker to start a few hours before the event, and it will automatically begin producing ice at the perfect time. When you get up early and need ice cubes, our Airtok ice maker has ice cubes ready for you",
                "Easy to Use: Our ice maker machine features a streamlined design for effortless operation. Simply fill the 1.6-liter water tank and press \"on\" to start making ice, then choose the ice cube size. The indicator light will automatically alert you when the water level is low, the ice maker will automatically stop when the ice basket is full. They all have separate buttons and indicator lights, so they are very simple and easy to operate",
                "More Efficient Self-cleaning: This ice maker boasts a powerful self-cleaning feature that completes 10 cycles in just 10 minutes. It's designed for maximum efficiency, ensuring your machine stays spotless while conserving energy. Enjoy the convenience of effortless maintenance and a consistently high performance. Solve your worries, rest easy after the party",
                "Beautiful and Durable Stainless Steel: Our ice maker countertop is crafted from high-quality stainless steel, won't crack as easily as plastic, providing durability and a sleek, modern look that fits seamlessly into any setting. The stainless steel material is also resistant to rust and corrosion, ensuring a longer lifespan and easier maintenance"
            ],
            "model": "28lbs/24H",
            "price": 129.99,
            "status": "In Stock",
            "last_month_sold": 200,
            "created_date": "2024-09-04T14:55:47.948315"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D25WPM8Y",
            "title": "Portable Washing Machine - 32Lbs Compact Twin Tub Washer and Spin Dryer - Semi-automatic Laundry Washer(22Lbs) & Spinner(10Lbs) Combo Timer Control with Drain Pump for Apartments,RVs,Dorms",
            "review_num": 57,
            "rating": 4.0,
            "description": [
                "Washes Off Easily - The portable washer and dryer has a powerful motor with up to 1600rpm, 360 watts of washing power, and 160 watts of spinning power to wash clothes quickly and efficiently. Up to 60Hz.",
                "32 lbs Large Capacity Twin Tub Washer -This portable washer has a total capacity of 32 lbs and saves up to 40% energy compared to other washing machines. Its spin and wash functions are combined into one unit for added convenience. Measuring 28.2*17.2*35.4inches, it's an ideal choice for limited-space settings like apartments, dorms, or RVs",
                "Semi-Automatic Controls - This portable small washing machine has 4 independent control knobs; you can set different washes according to your needs by using a timer rotary controller. Including wash selector, intensity,wash timer(3/6/9/12/15mins) and spin timer(1/2/3/4/5 mins). Help you save time and free your hands!",
                "Easy To Operate - Our portable washer machine and dryer panel has a water inlet/outlet with a hose connection for easy water filling. In addition, the washer is equipped with a drain pump for efficient drainage. Put in the laundry, add water, set the timer, and start washing. The compact and lightweight design makes it easy to fit into any space. In addition, the noise level is less than 20db for quiet operation.",
                "Reliably Quality - The laundry washer contains a unique cleaning function that deep cleans small and medium-sized garments such as shirts, underwear, and baby clothes without damaging them.",
                "Wash Friendly Design Focused - The portable washer dryer combo spinning drum has a cover that can be easily placed on top of your clothes to avoid high-speed discarding and keep your clothes organized. Portable clothes washing machines 42 pounds weight can be easily moved.",
                "WARM TIPS - BODACIOUS is specialized in washing machine, you just received the washing machine or use any problems encountered at any time and any place to contact us, Please trust us."
            ],
            "model": "32LBS Capacities",
            "price": 169.39,
            "status": "In Stock",
            "last_month_sold": 200,
            "created_date": "2024-09-04T14:56:23.017604"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0CFTR9LFT",
            "title": "Nugget Ice Maker Countertop, 40lbs/24H, Pebble Ice Maker with Soft Chewable Ice, Self Cleaning Sonic Ice Machine, Stainless Steel w/Touch Screen, Compact Design for Home Office Bar Party- Silver",
            "review_num": 55,
            "rating": 3.9,
            "description": [
                "Chewable & Slow-melting Clear Ice: With advanced technology, Keenstar nugget ice maker produces the softest, crunchiest, and most chewable ice. The pellet ice cube retains its flavor and tastes good, which is different from traditional hard cubes of full cube or bullet ice. Optimizes melting speed, and absorbs flavors of cocktails and other beverages.",
                "Fast & Continuous Nugget Ice Making: Professional compressor plus a 2.1L water tank allows the nugget ice maker to produce up to 40 lbs of ice per day. Perfect for preparing cold drinks for the whole family, or enjoying a cold brew on a quiet morning, easily turn your favorite beverages freezing cold in minutes. Never worry about running out of nugget ice!",
                "Simple Control Panel & Compact Design: Enjoy fresh ice with 3 easy steps! Fill the reservoir, switch the unit on, then press the Start button. Upgrade your home or office with an ice maker that is both fast and easy to use. This compact and portable nugget ice maker machine comes with a removable Ice basket for you to easily transfer ice cubes. Perfect for Home Party, Office, Bar, Outdoor, RV.",
                "Auto Self-Cleaning Function: Press on 'SELFCLEAN' button for more than 3 seconds to start self-cleaning and wait for 7 mins to complete daily cleaning. Using infrared sensing technology, the ice maker features an indicator light to notify when water needs to be added or when ice is full. For maximum water efficiency, unused ice will slowly melt into the reservoir, and ice production will restart automatically so fresh ice is always on hand. Around 45db sound level won’t disturb you. Give you peace of mind.",
                "Trusted Warranty & Service: We offer a 30-day money-back guarantee, free replacement within 1 year, and lifetime after-customer service from the date of purchase. Instruction manual is included to ensure the recipient knows how to use it. If any defective machine is received, please feel free to contact us immediately and we are always behind your back! So you can buy with confidence!"
            ],
            "model": "40Lbs/24H",
            "price": 199.99,
            "status": "In Stock",
            "last_month_sold": 600,
            "created_date": "2024-09-04T14:56:40.614352"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D17V3PM7",
            "title": "Nugget Ice Maker Countertop, 40lbs/24H Tooth-Friendly Soft Chewable Pebble Ice Machine, Self-Cleaning with Drainpipe, Crushed Pellet Ice Makers for Home Kitchen Party, Stainless Steel",
            "review_num": 35,
            "rating": 4.4,
            "description": [
                "Soft Chewable Nugget Ice: KOVIET nugget ice is made with Kim-Multilayer Super Chewable Ice, featuring tooth-friendly, soft and crunchy, which can retain drinks flavor and cool the drinks rapidly, ideal for cocktail, iced tea, coffee, juice and more",
                "Effective Ice Making: Produces up to 40lbs fresh nugget ice per day, unique brushless dual-fan cooling design and upgraded compressor allows the ice machine to operate efficiently. You can start enjoying your first batch of ice in 10 minutes, perfect for home and parties",
                "Automatic Cleaning: One-touch Self-Cleaning, 5-min Quick Cleaning, 30-min Deep Cleaning. Leak-proof design enables easily drained with drainpipe",
                "Quiet Operation: KOVIET IM01 Ice Maker adopts cellular noise reduction design, 40% less noise than other ice machines, and the interior of the ice maker is soundproofed with EVA technology, which greatly reduces operating noise",
                "Multi-function and Convenient: KOVIET IM01 Ice Maker features ice making cycle, k-vci nano cleaning system, smart indicator alerts, premium 360° double layer insulation, infrared sensor monitoring, power-off memory, air grill cooling, compact and space-saving, perfectly Integrated Into Your Kitchen",
                "Tips for Ice Maker: Hard water will affect your ice maker, you must clean your ice maker every two weeks or more frequently. It is recommended to move and store the ice in your refrigerator. The ice maker does not keep refrigerated"
            ],
            "model": "40lbs/24H",
            "price": 359.99,
            "status": "In Stock",
            "last_month_sold": 100,
            "created_date": "2024-09-04T14:57:14.071632"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0CY26RTDJ",
            "title": "BREEZOME Ice Maker Countertop, Portable Ice Machine Self-Cleaning, 9 Cubes in 6 Mins, 26.5lbs/24Hrs, 2 Sizes of Bullet Ice, Ice Cube Maker with Ice Basket and Scoop for Home Kitchen Party Camping RV",
            "review_num": 63,
            "rating": 4.4,
            "description": [
                "FAST ICE MAKING IN 6 MINS: Equipped with a 1.5L water tank and a powerful compressor, our ice maker capable of producing 9 bullet-shaped ice cubes in just 6-8 minutes. The maximum ice production capacity can reach 26.5 pounds in 24 hours. You don't have to worry about running out of ice.",
                "TWO SIZES OF ICE CUBES: Our countertop ice maker offers versatility with two ice cube sizes. Small ice cubes are perfect for making cold drinks like juices, cocktails and beverages. Large ice cubes are great for quickly cooling down food and drinks. Enjoy fresh ice and a refreshing summer in just a few minutes!",
                "SELF-CLEANING FUNCTION: Our ice maker machine equipped with an advanced self-cleaning function. Simply press the “SELECT” button to activate the “CLEAN” mode, after 30 minutes, your ice maker will be clean. For optimal taste, we recommend cleaning the machine with citric acid cleaning agent at least once a week.",
                "CLEAR VIEWING WINDOW & SMART: Our portable ice maker features a transparent viewing window and internal ambient light, allowing you to monitor the ice-making process and track ice capacity without opening the lid. Plus, indicator lights flash when the water is insufficient or the ice basket is full and the machine will stop automatically to remind you to refill water or empty the ice basket.",
                "CONVENIENT & WIDE APPLICATION: Complete with a removable ice basket and ice scoop, our ice cube maker offers convenient ice retrieval. Its compact size makes it easy to carry and suitable for various settings including kitchens, offices, RVs, bars, camping trips, and parties."
            ],
            "model": null,
            "price": 119.99,
            "status": "In Stock",
            "last_month_sold": 200,
            "created_date": "2024-09-04T14:57:51.521206"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0DF2S6NFS",
            "title": "Silonn Ice Maker Countertop Machine with Handle, 26lbs in 24h, 9 Ice Cubes Ready in 6 Mins, Self-Cleaning Ice Makers with Basket and Scoop, Ideal for Home, Kitchen, Camping, RV",
            "review_num": null,
            "rating": null,
            "description": [
                "Fast Ice Production: Generate bullet-shaped ice cubes in just 6 minutes! The powerful ice maker's compressor can produce up to 26 lbs of ice daily with a 1.3 lbs storage capacity",
                "Simple Control Panel: Fill the water reservoir, turn on the ice machine, and choose between small or large ice cubes! The countertop ice maker includes an indicator light to alert you when the water needs refilling or when the ice bin is full",
                "Ideal Compact Dimensions: At just 8.7 x 11.4 x 11.6 inches, this ice maker countertop fits easily on countertops, kitchen islands, or desks without occupying too much space",
                "Portable and Convenient: Equipped with a sturdy handle for easy transport, this ice maker machine weighs only 13.7 lbs and includes a scoop that attaches to the basket for convenient storage. It's perfect for moving between rooms or bringing to events",
                "Automatic Cleaning Function: Just remove the basket, add water, press and hold the CLEAN button for 5 seconds, and the machine will automatically clean itself in 30 minutes, so you can quickly start making fresh ice again"
            ],
            "model": "Black",
            "price": 84.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T14:58:41.633372"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D95L2LXZ",
            "title": "iSPECLE Large Chest Freezer Organizer Bins - Fit 10 to 20 Cu.FT Deep Freezer, 2 Pack Adjustable Hanging Baskets, Sort Food and Easily Get from Bottom of Freezer, Allow Air Circulation, Black",
            "review_num": 8,
            "rating": 4.8,
            "description": [
                "[Fit Most 10-20 Cu.Ft Chest Freezer] Stackable garage freezer baskets is 10.6\"-17.7\"(L) × 12(W) × 6.1(H), hanging freezer organizer is 19.3\"-24.8\"(L) × 12.2\"(W) × 7.6\"(H), can be expanded to fit the width of 10 to 20 cu.ft deep freezer, full use of the freezer width space, please measure if it fits your freezer inside",
                "[Sort Frozen Food Orderly] Multiple deep freezer organizer bins can sort and organize all kinds of meat, fish, bagged vegetables and ice cream; put the new food in the bottom, old or opened bags at the top hanging bins, and large packages on the motor of the freezer, avoid food lost and expire",
                "[Easy to Get & Rearrange] Fold down the handles to stack the chest freezer organizer bins to fully use the freezer space; Easily slide hanging bins and lift the bottom basket to get items, When organizing the freezer, just need to rearrange the freezer bins, without having to rearrange each package of food",
                "[Hold Heavier Food Not Deformed] The wireline of the freezer baskets for chest freezer is 20% thicker than the freezer baskets on the market, can hold more heavy frozen food; also you can see what's in the bins at a glance, even the bottom bins, save you time to find food",
                "[Faster Freeze for Better Freshness ] Compared with the traditional four-sided closed plastic box, this freezer storage container is made of open frames, lets air circulate for efficient freezing, and the food can be frozen faster, better preserving the freshness of food, also not affect close the freezer"
            ],
            "model": null,
            "price": 18.95,
            "status": "In Stock",
            "last_month_sold": 100,
            "created_date": "2024-09-04T14:59:14.008052"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D7ZG65QK",
            "title": "Simple Deluxe Portable Countertop Ice Maker, 26lbs Ice/24H, 9 Ice Cubes in 6 Minutes, with Basket and Ice Spoon, Self-Cleaning, for Indoor and Outdoor, Black",
            "review_num": 8,
            "rating": 4.4,
            "description": [
                "Small Noise Impact: The noise of this ice maker is below 35dB, this quiet feature allows you to make delicious iced drinks in a relaxed and peaceful atmosphere, and enjoy the cool feeling of summer.",
                "2024 New upgrade technology: With most advanced ice making technology, this ice maker has a fast ice-making production. It's capable of making 9 ice cubes in 6-8 minutes and up to 26 pounds ice per day, will be a perfect substitute for the old one in your home.",
                "Easy to carry: The ice maker is just 8.8(W)*11.6(D)*11.4(H) inches, weighs less than 14lbs and comes with a handy handle so you can easily carry it around, making it suitable for Home, Kitchen, Office, Camping, Party, etc.",
                "Automatic cleaning function: Hold the ON/OFF button for 5 seconds to activate the self-cleaning mode. Visible top can be used to observe not only the ice production schedule but also the progress of clean. Completely free your hands, add a little lemon or soda to help better cleaning.",
                "Simple Operation: Just pour the water into the machine (less than 1.2L), press the ON button. When it low on water, or ice basket is full (over 1.3lbs), the \"ADD WATER\" or \"ICE FULL\" indicator will remind by flashing. So it's very easy to use."
            ],
            "model": "Black",
            "price": 62.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T14:59:30.568959"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0DCF98G4Q",
            "title": "BANGSON 7.1 Cu.Ft Apartment Size Refrigerator with Freezer, Kitchen Fridge with Bottom Freezer, 2 Doors, 5 Settings Temperature Adjustable,Silver",
            "review_num": null,
            "rating": null,
            "description": [
                "Space-saving and enough capacity: this apartment fridge with bottom freezer, 21.3\" W x 20.7\" D x 54\"H, With a bottom freezer capacity of 1.65 Cu.Ft and a refrigerated section capacity of 5.45 Cu.Ft. This aprtment refrigerator is designed to optimize space while providing ample room for storing your favorite food and beverages.It is ideal for apartments,bedroom,office,and kitchen.",
                "5 temperature settings: The compact refrigerator has five temperature settings with excellent cooling performance. The freezer ranges from -5.6°F to 15.1°F and the refrigerator,from 32°F to 50°F. The temperature settings range from 1 (warmest) to 5 (coldest), with 3 being the optimal temperature. You can store various foods including meat, eggs, milk, beer,coffee,vegetables, fruit, and ice cream. Enjoy optimal food preservation with our adjustable temperature fridge.",
                "Efficient internal compartments: the 7.1 cu.ft fridge has a double-door design with a separate freezer and refrigerator. The refrigerated section includes removable glass shelves, you can freely adjust the height of the compartment in this area to meet your storage needs. The crisper drawer provides a separate storage area for fruits and vegetables. The side door racks offer beverage storage. There are two drawers in the freezer, which provides more storage space and is more tidy and orderly.",
                "Energy-efficient and quiet: This refrigerator is designed to save energy and operates at an average of 39 dB during normal use, which won't disturb your daily life.Please note that due to transport, the refrigerator may experience some bumps, so it's recommended to place it upright for 6-12 hours before plugging it in to ensure its quiet operation and longer lifespan.",
                "Enhanced details: BANGSON compact apartment size fridge comes with reversible doors to fit your preference. The automatic night light in the refrigeration compartment makes it easy to locate items in the dark. The bottom leveling legs allow it for stable placement on uneven surfaces. It also includes an ice tray, a defrost tool, and an egg shelf."
            ],
            "model": "7.1 Cu.Ft",
            "price": 429.99,
            "status": null,
            "last_month_sold": 50,
            "created_date": "2024-09-04T14:59:46.863890"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D5H8QSWH",
            "title": "Portable Washing Machine, Mini 12L Foldable Washer and Dryer with 3 Modes Deep Cleaning, Small Collapsible Laundry for Travel, Suitable for Baby Clothes, Underwear, Socks, Green",
            "review_num": null,
            "rating": null,
            "description": [
                "Portable Washing Machine: Our mini portable washing machine weighs only 3.9 pounds. It's compact and lightweight, making it perfect for apartments, dormitories, hotels, travel, or camping. It can be easily stored in small spaces.",
                "Easy to Use: This foldable washing machine features an automatic cleaning function and is equipped with three timer modes: 3 minutes, 5 minutes, and 10 minutes, allowing you to meet various washing needs with ease.",
                "Large Capacity: With a 12L capacity, this portable washing machine allows you to handle more laundry at once, increasing efficiency.",
                "Folding Design: The machine's clever foldable design makes it easy to store. When unfolded, it measures 11.8 x 11.8 x 13.0 inches, and when folded, it measures 11.8 x 11.8 x 6.5 inches, allowing it to store between shelves or under a bed without taking up much space.",
                "Removable Spin-Dry Basket: After washing, you can install the draining basket to use the spin-dry mode, which automatically removes residual water from your clothes."
            ],
            "model": null,
            "price": 49.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:00:26.700224"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D7ZKPX54",
            "title": "ONEEON 30\" Range Hood - 900 CFM Stainless Steel Wall Mount Kitchen Exhaust with 4 Speed Fan, LED Lights, Push Button, Ultra-thin Body, Chimney Style Stove Vent Hood & Ducted Exhaust Vent",
            "review_num": 6,
            "rating": 5.0,
            "description": [
                "MAXIMIZE YOUR SPACE: With our slim, 1.57\" thick design, our range hood is ideal for maximizing kitchen space while effectively removing grease and odors.",
                "POWERFUL PERFORMANCE: Equipped with a strong motor, our range hood provides up to 900 CFM of suction while offering a quiet mode for peaceful cooking.",
                "BRIGHTEN UP YOUR KITCHEN: Our range hood comes with 2 energy-efficient LED lights, providing bright and high-lumen lighting for clear cooking visibility.",
                "EASY TO CLEAN FILTERS: Our stainless-steel filters are dishwasher-safe, corrosion-resistant, and won't discolor or deteriorate over time like aluminum filters, making cleaning a breeze.",
                "1-YEAR GUARANTEE: We back our product with a 1-year guarantee on parts. If any components fail due to manufacturing defects, we'll supply replacement parts at no cost, so you can cook with confidence."
            ],
            "model": "Square Range Hood",
            "price": 319.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:01:02.285311"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D1G97NDD",
            "title": "Upgraded DA81-01345B French Refrigerator Door Spring Compatible With Samsung GE Fridge RF18HFENBSR RF217ACBP RF217ACPN RF217ACRS RF267AEBP Etc Models Replace WR02X12650 DA81-01345A Spring - 2 Pack",
            "review_num": 9,
            "rating": 4.5,
            "description": [
                "Spring Compatibility:The DA81-01345B refrigerator spring can replace WR02X12650 DA61-07471A, DA81-01345A, AP4577072, PS4163672, 2043373, WR02X12651 and is compatible with various Samsung GE refrigerator models, such as RF18HFENBSR, RF217ACBP, RF217ACPN, RF217ACRS, RF267AEBP, RF267AFWP, RF267HERS, RF268ABBP, RF268ABPN, RF268ABWP, RF268ABWP, RF26VABWP, RF26XAEBP, RF4267HABP, RF4287HARS, RF4267HAWP, RF4287HARS, RF4289HARS, RF4289HARS, RFG237AARS, RFG237ACRS, PFSS6PKXASS, RF217ACWP, RFG297AABP etc",
                "Spring Function:The DA81-01345B refrigerator door spring provides essential tension between refrigerator components, ensuring proper alignment and functionality of French doors, promoting energy efficiency and prolonging the lifespan of your french door fridge",
                "Spring Advantages:Spring DA81-01345B crafted from premium STS304 stainless steel, this spring boasts exceptional durability and strength, offering superior performance and reliability compared to standard OEM parts.Effortless installation saves time and hassle, while its precision engineering guarantees a perfect fit, maintaining optimal temperature control",
                "Spring Quality:Our refrigerator spring #sam-da81-01345b undergoes stringent quality control measures, ensuring exceptional durability and performance in demanding environments. Its robust construction enhances the longevity of your refrigerator. Precision engineering and premium materials ensure a reliable and long-lasting solution for your french door refrigerator needs",
                "Packaging content:This product listing includes 2 pack DA81-01345B french door refrigerator springs for samsung , providing you with all the necessary components for efficient installation and optimal performance"
            ],
            "model": null,
            "price": 5.87,
            "status": "In Stock",
            "last_month_sold": 50,
            "created_date": "2024-09-04T15:01:19.793062"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D4TTPY87",
            "title": "Frigidaire EFRF70136COM Chest Deep Freezer, 7 Cu. Ft. Capacity, Granita Rugged Design-Adjustable Thermostat-Removable Vinyl Coated Wire Basket-Easy Defrost Drain",
            "review_num": 10,
            "rating": 3.4,
            "description": [
                "Our chest freezer has a large capacity, allowing you to effortlessly store your favourite recipes, home groceries, and delicious foods.",
                "DESIGN - Bespoke 'Granita' textured finish that stands out!",
                "WELL DESIGNED - Interior drain plug and defrost drain mode for easy cleaning",
                "EASY CONTROL - Compressor On indicator and adjustable exterior Thermostat to perfectly froze any types of food such as seasonal harvests, meats and more",
                "COMPACT - Low footprint impact for surprisingly large internal capacity, ideal for small spaces"
            ],
            "model": "7 cu ft",
            "price": 299.99,
            "status": null,
            "last_month_sold": 100,
            "created_date": "2024-09-04T15:01:37.266752"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D815C1F8",
            "title": "iSPECLE Freezer Organizer Bins - 4 Pack Stackable Chest Freezer Organizer for 5 Cu.FT Deep Freezer Sort Frozen Food, Deep Freezer Organizer Bins Get Food Easily with Handle Add Storage Space, White",
            "review_num": 50,
            "rating": 4.5,
            "description": [
                "[Fit Most 5 Cu.Ft Chest Freezer] The size of the stackable freezer baskets is 14(L)*9.4(W)*5.1(H) inches, leaving a gap to see what is in the deep and place extra large packages; please measure whether the freezer organizer is fit the size of the available space inside the freezer",
                "[Sort Frozen Food Orderly] Multiple deep freezer organizer bins can sort and organize all kinds of meat, fish, bagged vegetables and ice cream; put the new food in the bottom, old or opened bags at the top, and large packages such as pizzas and ribs on the motor of the freezer, avoid food lost and expire",
                "[Easy to Get & Rearrange] Fold down the handles to stack the chest freezer organizer bins to fully use the freezer space; Easily lift the entire basket to access items you need, When organizing the freezer, you just need to rearrange the freezer bins, without having to rearrange each package of food",
                "[Better Ventilation, Better Freshness] Compared with the traditional plastic containers, this freezer storage container is made of open frames, which allows for the circulation of cold air throughout, cold air can better contact food, and faster freezing for better freshness",
                "[Hold Heavier Food Not Deformed] The wireline of the freezer baskets for chest freezer is 20% thicker than the freezer baskets on the market, can hold more heavy meats up to 33 lbs; also you can see what's in the bins at a glance, even the bottom bins, save you time to find food"
            ],
            "model": "White",
            "price": 39.89,
            "status": null,
            "last_month_sold": null,
            "created_date": "2024-09-04T15:03:01.291038"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D7ZHT6KW",
            "title": "Nugget Countertop Ice Maker, 44Lbs/Day Pebble Ice Machine with Soft Chewable Ice, One-Click Operation, Self-Cleaning, Portable Sonic Ice Maker with Ice Scoop & Removable Basket",
            "review_num": 68,
            "rating": 4.4,
            "description": [
                "MORE EFFICIENT ICE MAKING: Our efficient and portable table top ice maker ensures a constant supply of ice, with fast 6-minute ice making that produces up to 44 pounds of ice per day and a storage capacity of 1.5KG (3.3 pounds), enough for family/friends gatherings and outdoor events. The large capacity and efficient nugget ice maker won't make you anxious about waiting.",
                "CONTROL PANEL: Compact ice machine has the most advanced infrared sensor technology. When the ice basket is full, home ice maker will stop the ice making to prevent ice from overflowing. You can view the ice making process through the transparent window. When the water level in the water tank is insufficient, the indicator light will remind you to replenish water in time.",
                "SMARTER & EASIER OPERATION: Our crushed sonic ice maker is equipped with an intuitive LCD display and one-button controls, the one-button operation is designed to make it very convenient and easier for you to use, easier to operate, and easy to use for both the elderly and children. Meanwhile, the transparent ice basket allows you to monitor the ice making process at any time.",
                "TIMER & SELF-CLEANING: ADVWIN ice maker machine are equipped with self-cleaning function feature that allows for a thorough cleaning in just 15 minutes, making your maintenance routine much easier. The advanced cleaning system helps sanitize and descale with regular use, keeping ice fresh tasting and the machine performing at its best. In addition, the nugget ice maker has a timer function. You can also set the ice making time as needed, eliminating the hassle of waiting for ice cubes.",
                "CHEWABLE NUGGET ICE: Chewing crunchy ice is made from crushed ice cut with blades, as opposed to traditional hard block ice which are chewable, brittle, ready fast and retains its flavor. The optimal melting speed preserves the original flavor of whisky and cold drinks."
            ],
            "model": "44Lbs/Day",
            "price": 279.99,
            "status": "In Stock",
            "last_month_sold": 50,
            "created_date": "2024-09-04T15:03:35.023983"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D3TR935P",
            "title": "Portable Washing Machine, Rechargeable Cordless Mini Washing Machine with 2000mAh, Charge 1 Time and Up to Use 10 Times, 5L Portable Washer Machine for Baby Clothing, Underwear, Camping, RV Travel",
            "review_num": 5,
            "rating": 5.0,
            "description": [
                "Charge Once, Use Multiple Times, No More Worries About Finding A Power Source: This cordless mini washing machine, equipped with a 2000mAh large capacity battery, brings you freedom and convenience. Its 3-speed timing function makes washing smarter - 5 minutes for quick cleaning, usable up to 10 times, 10 minutes for thorough cleanliness, usable up to 5 times, and 20 minutes for deep care, usable up to 3 times.",
                "Compact Body and 5L Large Capacity: Within its modest dimensions of 8.1 * 8.3 * 9.6in lies an astonishing 5L capacity! This is our secret weapon, where a lightweight facade conceals boundless washing power. 2 garments, 4 undergarments, 2 baby clothes, or 1 pet outfit - no challenge is too great.",
                "IPX4 Waterproof Design, Perfect for Bathroom Use: Featuring an IPX4 waterproof design, you can confidently wash clothes while taking a shower, effortlessly managing life's chores. Say goodbye to worries about timing conflicts and indulge in the relaxation of your shower while getting your laundry done simultaneously.",
                "360 Degree Deep Cleaning: Built-in large impeller, powerful motor, upgraded washing performance. Efficient bidirectional cleaning removes stubborn sta-ins thoroughly, leaving every inch of fabric refreshed and revitalized.",
                "Multiple Scenario Use: It not only saves electricity and water, but also effectively reduces energy consumption. Whether in an apartment, camping site, or during travel and vacation, it provides you with a convenient user experience."
            ],
            "model": "White",
            "price": 59.99,
            "status": "In Stock",
            "last_month_sold": 50,
            "created_date": "2024-09-04T15:03:52.333522"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0DB5J6FSP",
            "title": "PERSONAL CHILLER Nugget Ice Maker Countertop Chewable Pellet Ice Cubes, Pebble Ice Maker Machine, 55lbs/24H Self-Cleaning LCE Machine, Soft LCE Machine for Home Bar, Coffee Shop, Kitchen",
            "review_num": 6,
            "rating": 4.8,
            "description": [
                "Highly Efficient Ice Production:Produce chewable nugget pellet ice in less than 5 minutes. Meet the fast ice production needs at home,restaurants, bars,kitchen,party",
                "Large Ice Production Capacity: Produce up to 55 pounds ice in 24 hours, this countertop ice maker operate with a one-button ice-making feature ensures you never run out of refreshing ice for your drinks",
                "Easy To Clean And Maintain: Equipped with a UV cleaning light and a removable drain for regular rinsing and keeping it clean. The clean button on the control panel is activated at the touch of a button for easy cleaning",
                "Robust And Durable:Made of high-quality stainless steel material, with highly durability and corrosion resistance, able to maintain its performance and appearance for a long time. Suitable for high-frequency use in commercial places",
                "Intelligent Operation:Adopt advanced energy-saving technology to effectively reduce energy consumption and carbon emissions. Excellent noise control not affect the operation of commercial premises"
            ],
            "model": null,
            "price": 198.0,
            "status": "In Stock",
            "last_month_sold": 50,
            "created_date": "2024-09-04T15:04:42.710493"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D3QFZC1S",
            "title": "Empava Double/Dual Induction Cooktop 2 Burner, Shatter-proof Flat Glass Top, 18 Levels from 120°F to 460°F, 3 Preset Mode, Bulit-in/Countertop, 110~120 Volt Plug in Electric Stove for Kitchen, RV",
            "review_num": 2,
            "rating": 5.0,
            "description": [
                "Ultimate Cooking Flexibility: Empava's 2-burner induction cooktop offers precise temperature control from 120°F to 460°F, accommodating a range of cooking techniques. Whether you're simmering, melting, or keeping food warm, adjust to the perfect heat with ease .",
                "Tailored Cooking Zones: With 18 temperature levels, customize your cooking with high efficiency and responsiveness. Whether you need quick boiling or gentle heating, this cooktop delivers consistent temperature for gourmet results every time.",
                "Intuitive Touch Controls: Streamline your cooking experience with advanced touch-sensitive controls that include a pause feature, timer, and dedicated settings for melt, keep warm, and simmer. Simple to use and easy to clean, enhancing your kitchen's functionality and style.",
                "Safety First Design: Keep your family safe with the integrated Child Lock system that prevents accidental activation. The cooktop also features an auto-shutoff safety feature, adding an extra layer of security when cooking.",
                "Seamless Installation Options: Designed for versatility, the Empava cooktop can be installed as a built-in unit or used as a portable countertop appliance, making it ideal for any kitchen configuration."
            ],
            "model": null,
            "price": 194.88,
            "status": null,
            "last_month_sold": 50,
            "created_date": "2024-09-04T15:04:58.747920"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D9MDLXBG",
            "title": "EUHOMY Commercial Under Counter Nugget Ice Maker Machine, 66Lbs/Day, Bulit-in Freestanding Ice Maker with Double Ice Baskets, Self-Cleaning & 24H Timer Ice Machine, for Commercial & Home Use(Silver)",
            "review_num": null,
            "rating": null,
            "description": [
                "Continuous Ice Supply: Euhomy commercial under counter ice maker machine produce 66 lbs of nugget ice in 24 hours, with a double-layer ice box design, the under counter ice machine ensures a continuous supply of pebble ice, meeting all your daily ice needs for your home, restaurant, bar or hotel.",
                "Chewable Nugget Ice: Nugget Ice also knowns as sonic ice or pebble ice, the nugget ice produced by our ice maker machine is crisp and chewy, not only making it the suitable choice for ice chewing enthusiasts, but also a great companion for various beverages such as cola, cocktails, and more.",
                "User-friendly LCD Control: The multifunctional control panel on the ice maker not only displays the ambient temperature, but also have the reminder of water shortage and ice full, help you to replenish water or remove ice promptly. meanwhile, the 24-hour timer and clean function lets you set the under counter ice machine to start or stop running at your convenience and clean your ice machine more easily!",
                "Keep Cold for longer: Our commercial under counter ice maker features an advanced insulation system that ensures, even when the ice bin is full, 80% of the pebble ice still remains unmelted for a full day. You can enjoy the delightful taste of pebble ice at any time you desire.",
                "Compact Design & Reliable Support: The dimensions of our built-in design ice maker machine is 15*18.03*32.48inches, which makes it perfect for any standard height kitchen or bar counter, while also allowing the ice maker to be used as a standalone unit. if you have any question while using the ice maker, please let us konw promptly, We're always here for you whenever you need assistance."
            ],
            "model": null,
            "price": 1.0,
            "status": null,
            "last_month_sold": null,
            "created_date": "2024-09-04T15:05:48.981260"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D1G86ZPN",
            "title": "Upgrade (2 Pcs) MHY62044106 Refrigerator Door Spring Replace MHY62044104 MHY62044103 Flapper Door Spring Compatible With LG Kenmore Electronics Refrigerator LFX25976ST LFX28978ST LFX28968SB LFX28968ST",
            "review_num": 9,
            "rating": 4.0,
            "description": [
                "Compatibility:The mhy62044106 refrigerator door spring and the MHY62044104 MHY62044103 refrigerator door spring can be completely replaced compatibility with LG Kenmore refrigerators",
                "Models Including: 79574043411, 79571043013, 79571606015, LFX21976ST/05, LFX21976ST/01, LFX25974SB/03, LFX28968D/00, LFX28968SB/00, LFX28968SB/01, LFX28968SB/02, LFX28968SB/03, LFX28968SB/04, LFX28968SB/05, LFX28968SB/06, LFX28968ST/00, LFX28968ST/01, LFX28968ST/02, LFX28968ST/03, LFX28968ST/04, LFX28968ST/05, LFX28968ST/06, LFX28968SW/04, LFX28978SB/02, LFX28978SB/03, LFX28978ST/01, LFX28978ST/02, LFX28978ST/04, LFX28978SW/02, LMX28988ST/06, LFX31945ST/01, LMX31985ST/00 etc",
                "Product Function:Restore proper functionality to your refrigerator doors with our refrigerator spring.Spring MHY62044106 applies tension between the parts of the refrigerator to ensure the door opens and closes properly",
                "Product Advantages and Quality:Crafted from premium quality steel, our mhy62044103 refrigerator door spring boast exceptional durability and strength. Engineered for longevity, they withstand daily usage without breaking, ensuring reliable performance over time.Featuring six coils for enhanced stability and resilience, our springs outperform traditional designs. The non-90-degree corner design ensures precise fitting, optimizing door operation",
                "Product Packaging Contents:Each pack includes 2 refrigerator door springs, This spring (part number MHY62044106) is for refrigerators.Wear work gloves to protect your hands when installing this part.(The spring has six coils, not three or five, and the angle is not 90 degrees, please confirm the style before purchase, please refer to the picture for details to avoid buying the wrong one)"
            ],
            "model": null,
            "price": 5.76,
            "status": "In Stock",
            "last_month_sold": 100,
            "created_date": "2024-09-04T15:07:11.154993"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D17MSMJ4",
            "title": "Mini Freezers Upright 3.6 Cubic Feet Freestanding Upright Freezers with Reversible Single Door, 3 Adjustable Thermostat, Small freezer for Apartment Office Silver",
            "review_num": 3,
            "rating": 5.0,
            "description": [
                "3.6 Cubic Feet Large Capacity -- 3.6 cubic feet of large internal capacity with 3 shelves and flexible storage space can reasonably store a variety of food. It can store food, fruits, vegetables, seafood, ice cream, just this small upright freezer , can meet the freshness needs of the whole family.",
                "3-Phase Temperature Design -- Built-in 3 temperature control knobs make it easy to adjust the desired temperature. 1\" for hottest and \"3\" for coldest allows you to fine-tune the temperature between -13°F and 23°F. The one-piece design with upgraded seals and insulation reduces frost and is easy to clean.",
                "Convenient Design -- This upright freezer has 2 adjustable levelling feet to adjust the height of the freezer to your needs. -the door opening direction can be switched from left to right, allowing you to adjust the opening and closing direction of the fridge door according to your actual needs.",
                "Quiet And Energy Efficient -- The 3.6 cu. Ft. Mini freezer is equipped with an R600a low noise compressor for fast cooling. The operation sound is less than 40 db, which will not affect your normal life.",
                "Multi-Situation Application: This freezer is designed to meet the needs of a wider range of people, perfect size for college dorms, rvs, flats or offices."
            ],
            "model": "SILVER",
            "price": 210.59,
            "status": null,
            "last_month_sold": null,
            "created_date": "2024-09-04T15:08:03.550464"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D6WJ76FD",
            "title": "iSPECLE Upright Freezer Organizer - 4 Pack Small Freezer Basket for 5/6 / 6.5/6.8/7 cu.ft Freezer Easy Sort Food & No More Fall off, Freezer Bins for Upright Freezer Allow Air Circulation, Black",
            "review_num": 2,
            "rating": 5.0,
            "description": [
                "[Sort & Storage Food Orderly] Multiple deep freezer organizer bins can help sort and store various foods by type: 1 basket for meat, 1 for vegetable bags, 1 for ice cream, etc. New food are put at the top or bottom in freezer, the old & opened are put in middle area and eat it first to avoid food lost in freezer",
                "[Easily & Quickly Access Food] Line design can see the food in the wire freezer baskets, easily locate the desired food, directly pull out the entire basket to quickly get or restock food without digging throughout the freezer, put the basket back into freezer after use, more efficient & time-saving",
                "[Avoid Food Sliding Off] Upright freezer storage bins size is 13.8 x 12.2 x 4.9 inches, fit for 5 / 6 / 6.5 /6.8 / 7 cu.ft freezer, each shelf can place 1 wire basket. High fence of the freezer basket surrounds the food, so food no longer slide out when the door is opened, making it safer to use",
                "[Air Circulation for Effective Freezing] Unlike closed plastic boxes, wire baskets for freezer can speed up the circulation of cold air around the food, which will not affect the freezing effect even in the metal basket, achieving efficient cooling and better keeping the freshness of food",
                "[Sturdy without Deformed] Upright Freezer organizer baskets made of 20% thicker wire, can easy hold heavier food, will not deform with carried and moved. Stand up freezer organizer binswill not crack even long-term use in low-temperature freezer, longer service life helps you save replacement costs"
            ],
            "model": "Black",
            "price": 8.07,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:09:25.728484"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D5CRSZCT",
            "title": "Stove Top Covers for Electric Stove,28\" x 20\" Silicone Stove Top Mat,Heat Resistant Silicone Stove Top Protector,Foldable Thick Glass Top Protector to Prevent Scratching-Black,with 2 Cleaning Brush",
            "review_num": 1,
            "rating": 5.0,
            "description": [
                "HEAT RESISTANT & RAISED RIDGES DESIGN: Our glass top oven cover protector can hold heat up to 450 °F, this silicone mat for glass stovetop as an ironing mat or for placing hot plates on. Raised wide ridges of glass cooktop cover will separates the hot pot from the table, protect your kitchen surfaces from scalding. Furthermore, the non-slip coating of our electric stove top cover heat resistant makes the stove top cover stay in place when using it",
                "PROTECTIVE AND ELEGANT STOVE TOP COVER: This electric stove top protector measures 20\" x 28\" and comes with 2 cleaning brushes, completely covers your stove top protecting the glass or ceramic from dust and scratches, or covering stains and scratches. The gas top stove cover also serves as a buffer to protect against falling items from cabinets installed above your stove",
                "FOOD GRADE SILICONE MATERIAL: The material of the silicone glass top stove cover protector is made of BPA-free rubber, ensuring safety, durability and longevity. Our silicone mat for stove has a rubberized bottom that ensures it won't slip while in use. Raised textures on the stove top board prevent items from rolling off, providing added security when cooking",
                "EXTRA COUNTER SPACE: Our electric stove mat protector will give your an additional work surface and it's great to prepare food or any kitchen activity you need more counter space. In addition, the stove top mat for electric stove provides decorative and aesthetic protection for your stovetop, and the stove protector mat look like a natural part of your kitchen.",
                "MULTIPURPOSE KITCHEN MAT: It is not only a silicone mat for stovetop, but also can be used as a tableware drying mat, washing machine top cover, placed on the washing machine to block the ash layer, used as a pad for ironing clothes",
                "NOTE: Please DON'T put the kitchen stove cover on the electric cooktop while it's temperature over 450 °F"
            ],
            "model": null,
            "price": 19.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:10:30.228000"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D7Q5Z7KD",
            "title": "Portable Twin Tub 18lbs Washing Machine with Drying Rack, 11lbs Washer Mini Compact Laundry Machine and 7lbs Spinner, Semi-automatic Washer Combo for Dorms, Apartment (18lbs)",
            "review_num": 2,
            "rating": 5.0,
            "description": [
                "Cost-Effective Washing machine: Save money and time by doing laundry at home. Avoid laundromats and their costs—equivalent to about 30 trips",
                "Powerful Performance: 1300RPM motor, 60Hz, 11 lbs washer, 7 lbs spinner. Translucent tub for easy monitoring",
                "Compact and Space-Saving: Wash timer up to 15 minutes, spin timer up to 5 minutes. Perfect for small spaces like bathrooms, dorms, and RVs",
                "Quiet Operation: Low noise level ensures a peaceful environment during use.",
                "Compact Design: Fits easily in apartments, RVs, and small homes without sacrificing performance. Lightweight and easy to move, with convenient handles for transportation."
            ],
            "model": "18lbs",
            "price": 59.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:12:09.650853"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D8B5Y7R8",
            "title": "Advanced DG47-00063A MEE62385201 10-Inch Range Surface Element Dual Radiant Surface Element - Replacement For Samsung Stove Range AP5986690, PS11729065, 4958261, and EAP11729065",
            "review_num": 10,
            "rating": 5.0,
            "description": [
                "DG47-00063A Energy Efficiency Rockstars - German engineering meets half-bridge tech, MEE62385201 means energy gets fed back like a pro, minimizing waste and maximizing circuit efficiency.",
                "MEE62385201 Scorching Performance - We know you love it hot, hot! That's why our DG47-00063A temp probes are encased in borosilicate glass, handling heat up to 1382°F like a boss. With only ±9°F margin of error, you can trust us to bring the heat!",
                "DG47-00063A Safety First (Always!) - No burns, no worries! Our MEE62385201 stove plates are made from top-notch glass-ceramic material, keeping the cooking zone hot and the rest chill. No more ouchies!",
                "MEE62385201 Environmentally Proud - DG47-00063A, We are all about being green, non-toxic, and US-standard-approved! We've got the certifications to prove it, so you can use our thermocouples with a clear conscience.",
                "DG47-00063A Lifetime Warranty (and more!) - We're so confident in our MEE62385201 that we're willing to put our money where our mouth is - with a lifetime warranty! And if you've got questions, our 24/7 customer support superheroes are here to save the day!"
            ],
            "model": "MEE62385201",
            "price": 47.98,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:12:25.993030"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D4Z9Q5QY",
            "title": "Portable Range Hood for Cooking, Adjustable Angle & Height Desktop Range Hood with 2 Speed Exhaust Fan, Oil Collection Cup, Detachable Filter, Mini Kitchen Fume Extractor for Indoor BBQ, Hot Pot",
            "review_num": 6,
            "rating": 4.3,
            "description": [
                "Cute Stove Buddy - Compact and lightweight range hood is designed for easy portability and convenient storage. Ideal for apartment living and small kitchen to purify the cooking air.",
                "Detachable Dual Filter - This portable range hood is equipped with a double-layer aluminum filter for grease and a polymer filter for odors. Efficiently remove cooking fumes, freshing the air.",
                "Adjustable Kitchen Fan - 2 Speed kitchen hood. You can easily adjust the angle to meet your needs. And press the Up/Down button to adjust the height of this mini stove hood.",
                "Easy To Use & Clean - No installation needed, low noise operation. Simply wipe the surface with a clean rag, while the dishwasher-safe filter ensures hassle-free cleaning, keeping stains and grease at bay.",
                "Widely Application - The desktop fume extractor is perfect for use in small kitchens and countertops or in tight living spaces, like studio apartment, dormitory, RV, indoor BBQ, hot pot and more."
            ],
            "model": null,
            "price": 45.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:12:43.055407"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D3BZGG3X",
            "title": "Portable Washing Machine, FETIONS 11L Foldable Washer with 3 Modes, Deep Cleaning of Underwear, Baby Clothes and Other Small Clothes, Suitable for Apartments,Dormitories,Hotels,Camping,Travel, Green",
            "review_num": 11,
            "rating": 3.4,
            "description": [
                "Portable Washer Machine: This mini washing machine is small, foldable and easy to carry, allowing you to do your laundry wherever you are, suitable for apartments,dormitories,hotels,camping and travel.",
                "11L Large Capacity Design: This mini washing machine featuring a 11-liter large capacity and blue light, ensuring you can handle more small laundry such as baby clothes, underwear, socks and other small clothes at once for increased efficiency and healthy.",
                "3 Modes Timer Design: This foldable washing machine has a semi-automatically cleaning function with 3 minutes, 5 minutes and 10 minutes.These 3 modes timer buttons allowing you easily to complete various washing requirements. Kindly note: Fill the washing machine with 2/3 of water to achieve better washing effect.",
                "Folding Design: This portable washer adopts a foldable design, which measures 12x12x6inches when folded. Easy to store, it can be easily placed between shelves or under the bed without taking up too much space in your home.",
                "Folding Design: This portable washer adopts a foldable design, which measures 12x12x6inches when folded. Easy to store, it can be easily placed between shelves or under the bed without taking up too much space in your home.",
                "NOTICE: If there are any questions with the product, please contact us directly via Amazon, we will deal with it at first time. We provide friendly customer service and help you to solve the problem."
            ],
            "model": "Green",
            "price": 38.59,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:13:36.343677"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D45J36DV",
            "title": "Portable Washing Machine, 11L Large Capacity, Mini Washing Machine with Spin Dryer, Small Foldable Laundry Washer for Travel, Rv, Dorm, Capming, Apartment, Socks, Underwear, Baby Clothes, Green",
            "review_num": 5,
            "rating": 5.0,
            "description": [
                "[Mini Washer for Small Clothes]: Tips for daily life: Washing clothes separately can avoid cross infection. This small washing machine is designed specifically for small clothes. It is used to wash clothes that require separate cleaning, such as underwear, socks, baby clothes, diapers, towels, vests, toys. The portable washer machine and dryer can makes your clothes cleaner and hygienic. You can say goodbye to hand washing, exquisitely care for your little laziness.",
                "[Smart Mini Washing Machine]: This is a semi-automatic smart washing machine that integrates washer and spin dryer. The bucket foldable washing machine has 3 deep cleaning modes: 10min Standard washing, 5min Soft washing, and 3min Semi Dehydration. It is easy to use, touch the electronic panel, washing with one click. The 360 ° deep washing of positive and negative wave wheels can effectively remove various stains. Protect your and your family's health, say goodbye to stubborn stains~",
                "[Large 11L Portable Washer]: The personal hygiene washing machine has a family gold capacity of 11L, and can wash all underwear at once. It can hold up to 13 lb water + 8 Pcs underwear /12 Pcs socks /5 Pcs baby clothes /6 Pcs of pet clothes. Mini portable washing machine foldable uses high frequency vibration, positive and negative wave wheel to imitate hand washing clothes, strong deep cleaning, effective removal of dirt. Free your hands and save your precious time.",
                "[Energy-saving Laundry Washer]: The portable washer adopts a low energy consumption and noise reduction motor, and the bottom motor compartment is improved to make the center of gravity sink, making the entire machine run more smoothly without shaking, with less noise, and not afraid of disturbing you, your family, and neighbors for rest. The small load and low power consumption of a small washing machine can save energy, and save water and electricity.",
                "[Bucket Foldable Washing Machine]: The mini washing machine is made of upgraded environmentally friendly materials, which are more resistant to aging. The portable washing machine and dryer adopts a foldable portable bucket design, with a unfolded volume of 11.6 * 11.6 * 11.4 inches. Its folded volume is only 11.6 * 11.6 * 5.5 inches, making it easy to store when not in use and not occupying too much space. It is easy to carry and is very suitable for Home, camping, travel, and RVs."
            ],
            "model": "Purple",
            "price": 59.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:13:53.226250"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0DBVDJWXB",
            "title": "Deep Freezer Cover, Waterproof Dustproof Chest Freezer Cover, Freezer Covers for Outside 7.0 Cubic Feet Chest Freezer All Season Protection, Top with Zipper to Open(35\"L X 21\"W X 33\"H)",
            "review_num": 3,
            "rating": 4.6,
            "description": [
                "CHEST FREEZER COVER SIZE: This cover size is 35\" x 21\" x 33\" (L x W x H), Suitable for all chest freezers of this size. Please measure the length, width, and height of your chest freezer before purchasing.",
                "DURABLE MATERIAL: The outdoor deep freezer cover is made of durable 420D waterproof oxford fabric with a waterproof coating inside, which is fade and tear resistant, high density stitched for durability. It effectively protects your freezer from rain, dust, sunlight, dirt and moisture, and other outdoor elements.",
                "CONVENIENT HANDLE: Designed with two handles, this chest freezer cover is extremely easy to install and remove. The handles provide a convenient grip, allowing you to effortlessly put on or take off the cover whenever needed.",
                "CONVENIENT DOUBLE ZIPPER DESIGN: The double zipper design allows you to easily access your freezer without having to remove the entire cover. Simply open the zipper and reach in to use your freezer. Additionally, the zipper pocket provides extra storage space for small accessories like bottle openers.",
                "ADJUSTABLE STRAPS DESIGN: Equipped with two adjustable straps, this freezer cover for outside ensures that it stays securely in place even in windy conditions. The straps can be tightened to prevent the deep freezer cover from being blown off, providing reliable protection throughout the seasons."
            ],
            "model": "35\"L X 21\"W X 33\"H",
            "price": 24.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:14:09.586794"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0DCBB3JW6",
            "title": "2.3 Cu.Ft Mini Beverage Refrigerator with Glass Door, 75 Can Capacity, Adjustable Shelves, Small Fridge, Suitable for Soda, Beer, Beverages, Essential for Home/Bar/Office.",
            "review_num": 3,
            "rating": 5.0,
            "description": [
                "COMPACT YET SURPRISINGLY SPACIOUS - Our beverage refrigerator offers 2.3 cubic feet of space, easily accommodating up to 75 beverage cans. Its adjustable shelf design allows you to store various bottle sizes. Whether placed on a countertop, table, or in a room, it provides convenient access to your favorite beverages or beers anytime.",
                "SMART TEMPERATURE CONTROL - The smart mini fridge comes with a temperature control button, allowing you to easily and precisely adjust between 35°F and 65°F. Thanks to advanced compressor technology, it maintains a stable refrigeration environment even amidst external temperature fluctuations, ensuring your beverages stay perfectly chilled at all times.",
                "CLEAR VIEW DOUBLE-LAYER GLASS DOOR - Featuring double-layer tempered glass and airtight sealing for excellent insulation. The transparent design allows you to easily see the quantity of beverages inside the cooler.",
                "THOUGHTFULLY DESIGNED - This beverage cooler features a powerful yet quiet compressor. Built-in blue LED lighting ensures you can easily find your drinks even at night, enhancing their visual appeal. The adjustable shelf design accommodates various types of beverage containers.",
                "SILENT OPERATION - Utilizing advanced cooling systems to maintain beverages at optimal temperatures without noise disturbance, making it the perfect choice for your indoor space. Please note: This refrigerator is designed specifically for beverage cooling and is not suitable for storing fresh food."
            ],
            "model": null,
            "price": 149.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:16:40.643839"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D1DKVY68",
            "title": "AKDY 30 in. Island Mount Range Hood, 3-Speed Fan and LED Lights in Stainless Steel with Tempered Glass, Convertible Range Hood Ducted to Ductless with 2-Sets of Carbon Filters",
            "review_num": 3,
            "rating": 3.1,
            "description": [
                "The range hood comes with a decorative chimney that accommodates ceiling heights ranging from 8 feet to 8.5 feet",
                "Convertible for ventless use: Comes with 2 sets of charcoal filters good for a one-year filter supply (Replace approximately every six months) (CF0011)",
                "Powerful Performance: Experience the power of a 350 CFM fan that efficiently removes smoke, steam, and odors from your kitchen, leaving the air clean and crisp. Even at its highest speed, it maintains a peaceful cooking environment.",
                "Bright Illumination: Illuminate your cooking area with four LED lights, providing ample brightness for cooking tasks. Enjoy enhanced visibility and ambiance in your kitchen while preparing delicious meals.",
                "Easy Maintenance: Cleaning and maintaining this range hood are effortless thanks to its removable 5-layer aluminum mesh filters. Hand-washable and durable, these filters efficiently trap grease and oil particles, ensuring long-lasting performance.",
                "Versatile Control: Easily adjust fan speeds with the Push Button Control, offering three variations to suit your cooking preferences.",
                "Sustainable Materials: Constructed with durable stainless steel and tempered glass, offering longevity and style to your kitchen.",
                "AKDY offers a 3-year limited parts warranty against product defects."
            ],
            "model": null,
            "price": 299.99,
            "status": null,
            "last_month_sold": null,
            "created_date": "2024-09-04T15:17:14.124754"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0DBQ87GV8",
            "title": "Nooody 3.5 Cu.Ft. Chest Freezer with Removable Basket and Front Defrost Water Drain, Small Deep Freezer Perfect for Homes, Garages, and RVs, White",
            "review_num": null,
            "rating": null,
            "description": [
                "LARGE CAPACITY: The 3.5 cu. ft. capacity provides you with the extra storage for all your frozen goods such as meat, pizza, cold drinks, fruits and vegetables and ice cream – making it perfect for homes, basements, garages, RVs and more!",
                "QUICK FREEZING SYSTEM: The D-Type Refrigeration tube has more surface area, a larger heat exchange area and a higher efficiency, allowing the freezer to get colder faster than other chest freezers. The aluminum-lined interior with a heavy-duty gasket also creates a tight seal, preventing cold air from escaping",
                "ADJUSTABLE THERMOSTAT: The adjustable thermostat is easy to access and features a minimum/maximum control dial that allows your temperature to be controlled from -10 to 10 °F",
                "REMOVABLE WIRE BASKET: Convenient hanging coated wire storage basket easily removes and slides for easier organization and helps you keep smaller items readily available so they don’t get lost",
                "LOW NOISE: High-efficient foam is used to help insulate the interior and lid keeps the noise low, allowing for a super-quiet operation"
            ],
            "model": null,
            "price": 159.99,
            "status": null,
            "last_month_sold": null,
            "created_date": "2024-09-04T15:17:49.171489"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D5XT582T",
            "title": "FIREGAS Black Range Hood 36 inch Under Cabinet, Ducted/Ductless Convertible Kitchen Hood, Black Painted Stainless Steel Vent Hood with LED Light,2 Speed Exhaust Fan",
            "review_num": null,
            "rating": null,
            "description": [
                "Sleek design: Slim profile saves space. Great for condos and apartments. Range hood can be used ductless. Suitable for top or back venting. This Range Hood can be installed under a cabinet or against a wall. Product Dimensions: 36\"W x 17.5\"D x 4.7\"H.",
                "36 inch hood: 20gauge brushed stainless steel, 430-grade for unparalleled quality,36 inch range hood with aluminum mesh filters,dishwasher safe and reusable. Trap grease and oil efficiently. Leave your kitchen clean with fresh air.",
                "Powerful but really quiet: Stainless steel kitchen stove vent hood with 300 CFM, 2 speed exhaust fan, effectively removes smoke and odors. Ultra quiet operation, less than 57dB at high speed.",
                "Works Perfectly: Superior Multi-layer filters trap grease more effectively. easy 2-button controls, simple operate and sensitive reaction. Easy to turn on and off, Low and High Speed button suitable for different cooking method.1 x 2W LED offer enough brightness to meet your cooking need.",
                "1 Year limited warranty: Please contact our tech support team when you need our assistance with our kitchen range hoods. Great pleasure to offer you the best service."
            ],
            "model": null,
            "price": 74.99,
            "status": null,
            "last_month_sold": 50,
            "created_date": "2024-09-04T15:18:55.891978"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0CWJKDL1T",
            "title": "Portable Clothes Dryer for Laundry - Premium Dryer for Apartments, RV, Travel-Compact Dryer, Foldable with Timer, Sturdy, Easy to use, For light clothing Underwear, Baby Clothes",
            "review_num": 10,
            "rating": 5.0,
            "description": [
                "Space-Saving Design: This portable dryer is designed for apartments, RVs, and travel, offering convenience without sacrificing performance. Its compact size makes it perfect for tight spaces.",
                "Efficient Drying: With powerful yet gentle drying action, this portable dryer ensures your clothes are ready to wear in no time. Say goodbye to damp garments and hello to convenience.",
                "Versatile Usage: Whether used as a standalone dryer or paired with a portable washer, this dryer offers a complete laundry solution for travelers or those living in small spaces. Adapt to your needs effortlessly.",
                "Easy Setup and Operation: Plug in the dryer, load your clothes, and select your desired settings—it's that simple. Enjoy hassle-free drying wherever you are, making laundry day a breeze.",
                "Bonus Travel Bag Included: Receive a complimentary travel bag with your purchase, making it even easier to transport and store your portable dryer while on the go"
            ],
            "model": null,
            "price": 59.99,
            "status": "In Stock",
            "last_month_sold": null,
            "created_date": "2024-09-04T15:19:31.159381"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D95LCQYW",
            "title": "Portable Washing Machine,Mini Washer,11L Large Capacity Foldable Washer and Dryer 2 in 1 for Underwear, Baby Clothes Apartments, Dormitories",
            "review_num": 4,
            "rating": 5.0,
            "description": [
                "11L Portable Washing Machine: Say goodbye to handwashing with our innovative portable washer machine. Perfect for small clothing items like underwear, socks, and baby clothes, this mini washer provides a thorough clean for all your laundry needs. Compact and foldable, it's the ultimate solution for keeping your clothes fresh and hygienic.",
                "Convenient Mini Washer: Discover the ultimate convenience with our portable washing machine and dryer combo. This automatic mini washer boasts a foldable design and user-friendly electronic panel, making laundry a breeze with its 3 deep cleaning modes. The innovative 360° deep washing system ensures thorough stain removal, guaranteeing the cleanliness and hygiene of your family's clothes.",
                "Efficient and Convenient: Experience the ultimate in time-saving and user-friendly laundry care with our portable folding washing machine. Boasting a spacious 11L capacity and constructed from premium ABS materials, this mini washer ensures durability and safety for your laundry needs. The use of food-grade materials guarantees a comfortable and odor-free washing experience, making it perfect for cleaning undergarments, socks, baby clothes, and more.",
                "Portable and Long-lasting: Crafted from high-quality materials, our portable mini washer is designed for durability and longevity. The innovative foldable bucket design ensures effortless storage and portability, making it the perfect companion for families, apartments, camping trips, travel, and RVs. Experience the convenience of a compact and reliable washing solution that maximizes space efficiency without compromising on cleaning effectiveness."
            ],
            "model": "Grey",
            "price": 68.99,
            "status": null,
            "last_month_sold": null,
            "created_date": "2024-09-04T15:19:47.828028"
        },
        {
            "category_asin": -1,
            "category_name": "Appliances",
            "product_asin": "B0D949T25G",
            "title": "Cap Valve Assembly for Opal Ice Maker Water Tank, Replacement Cap (1 Pack)",
            "review_num": null,
            "rating": null,
            "description": [
                "[Introduction] Ice maker water tank cap replacement. Designed specifically for compatibility with opal models, only 1 in package.",
                "[Function] Work with opal ice maker, ensure a steady supply of fresh ice, also regulate water flow to prevent leakage.",
                "[Material] Made of upgraded premium plastic, providing long-lasting service time and consistent performance.",
                "[Installation] Easy to replace the broke or worn-out one and install the new part, with no special tools required.",
                "[Note] Enhance the performance of your ice maker, get it back up and running in no time, extend the life of your appliance."
            ],
            "model": null,
            "price": 17.55,
            "status": "In Stock",
            "last_month_sold": 50,
            "created_date": "2024-09-04T15:20:25.470525"
        }
    ],
    "product_count": 39,
    "sub_category_list": [],
    "sub_category_count": 0
}